tap "buildpacks/tap"
tap "carlocab/personal"
tap "dagger/tap"
tap "elastic/tap"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "jimihford/hendrix"
tap "junk16/custom"
tap "kaos/shell"
tap "kegworks-app/kegworks"
tap "laishulu/homebrew"
tap "modularml/packages"
tap "mongodb/brew"
tap "netmute/tap"
tap "shivammathur/php"
tap "spring-io/tap"
tap "universal-ctags/universal-ctags"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU compiler collection
brew "gcc"
# OpenType text shaping engine
brew "harfbuzz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# AI pair programming in your terminal
brew "aider"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# All in one for **env
brew "anyenv"
# Top-like display of Apache log
brew "apachetop"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Library for USB device access
brew "libusb"
# Atmel AVR MCU programmer
brew "avrdude"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Parser generator
brew "bison"
# Freely available high-quality data compressor
brew "bzip2"
# SIMD-accelerated C++ JSON parser
brew "simdjson"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AI-powered coding agent for complex work
brew "cline"
# Cross-platform make
brew "cmake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Generic library support script
brew "libtool"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# New file format for still image compression
brew "jpeg-xl"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Cluster ssh tool for Terminal.app
brew "csshx"
# LSP implementation using universal-ctags as backend
brew "ctags-lsp"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Tools for browsing and manipulating docker registries
brew "docker-ls"
# Text processing system for reStructuredText
brew "docutils"
# General purpose Language Server
brew "efm-langserver"
# Software for flashing the EMS Gameboy USB cart
brew "ems-flasher"
# ISO AAC audio encoder
brew "faac"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Free lossless audio codec
brew "flac"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Vorbis general audio compression codec
brew "libvorbis"
# C library for files containing sampled sound
brew "libsndfile"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# File harvester to ship log files to Elasticsearch or Logstash
brew "filebeat"
# Amiga emulator
brew "fs-uae"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Utility for downloading TV and radio programmes from BBC iPlayer
brew "get_iplayer"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Source code tag system
brew "global"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Multi-threaded malloc() and performance analysis tools
brew "gperftools"
# JDK distribution with Graal compiler and Native Image
brew "graalvm"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Gorgeous metric visualizations and dashboards for timeseries databases
brew "grafana"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Fulltext search engine and column store
brew "groonga"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Kubernetes package manager
brew "helm"
# Tool to report network interface bandwidth
brew "ifstat"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Time series, events, and metrics database
brew "influxdb"
# Audio Connection Kit
brew "jack"
# Git-compatible distributed version control system
brew "jj"
# Load testing and performance measurement application
brew "jmeter"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# BSD-style licensed readline alternative
brew "libedit"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Conversion library
brew "libiconv"
# C and C++ client library to the memcached server
brew "libmemcached"
# GNOME XML library
brew "libxml2"
# Next-gen compiler infrastructure
brew "llvm"
# Tool for managing events and logs
brew "logstash", restart_service: :changed
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Convert nroff man pages to HTML
brew "man2html"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: :changed
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# High performance, distributed memory object caching system
brew "memcached"
# Open controller for the MiniPRO TL866xx series of chip programmers
brew "minipro"
# Cross-platform application and UI framework
brew "qt"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Command-line Git information tool
brew "onefetch"
# AI coding agent, built for the terminal
brew "opencode"
# MSX emulator
brew "openmsx"
# Port of pdftk in java
brew "pdftk-java"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# Draw UML diagrams
brew "plantuml"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14"
# Service monitoring system and time series database
brew "prometheus"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Show ps output as a tree
brew "pstree"
# Cross-platform application and UI framework
brew "qt@5"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Software environment for statistical computing
brew "r"
# Generate C-based recognizers from regular expressions
brew "re2c"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Tool to convert RPM package to CPIO archive
brew "rpm2cpio"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Ruby version manager
brew "rv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Sigrok command-line interface to use logic analyzers and more
brew "sigrok-cli"
# Manage code quality
brew "sonarqube"
# SOund eXchange: universal sound sample translator
brew "sox"
# Toolkit to help you get started with Spec-Driven Development
brew "specify"
# Feature-rich console based todo list manager
brew "task"
# User interface to the TELNET protocol
brew "telnet"
# Haskell library for converting LaTeX math to MathML
brew "texmath"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# General-purpose lossless data-compression library
brew "zlib"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack", trusted: true
# Terraform
brew "hashicorp/tap/terraform", trusted: true
# Memory training application
cask "anki"
# Agent orchestration platform
cask "antigravity"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Digital audio mixing application
cask "au-lab"
# Multi-track audio editor and recorder
cask "audacity"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Virtual Audio Driver
cask "blackhole-64ch"
# Open source IDE for exploring and testing APIs
cask "bruno"
# CD burning application
cask "burn"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Node-based image, video and audio generator
cask "comfyui"
# Server and cloud storage browser
cask "cyberduck"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Fork of the DOSBox project
cask "dosbox-x-app"
# Developer platform
cask "dotnet-sdk"
# Electronic design automation software
cask "eagle"
# Web browser
cask "firefox"
# Dreamcast, Naomi and Atomiswave emulator
cask "flycast"
cask "font-caskaydia-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# 3D parametric modeller
cask "freecad"
# Amiga emulator
cask "fs-uae-emulator"
# Amiga emulator launcher
cask "fs-uae-launcher"
# Virtual COM port driver
cask "ftdi-vcp-driver"
# Hosts file editor/manager
cask "gas-mask"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source video transcoder
cask "handbrake-app"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Application for generating k6 test scripts
cask "k6-studio"
# Keyboard customiser
cask "karabiner-elements"
# Porting tool, to make Windows programs/games into native apps
cask "kegworks"
# Electronics design automation suite
cask "kicad"
# CAD application
cask "librecad"
# Discover, download, and run local LLMs
cask "lm-studio"
# Application to spoof your iOS, iPadOS or iPhoneSimulator device location
cask "locationsimulator"
# SPICE simulation software, schematic capture and waveform viewer
cask "ltspice"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Video format converter (transcoder)
cask "makemkv"
# Utility that automatically downloads firmwares and installers
cask "mist"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Audio editor
cask "ocenaudio"
# Retro video game emulation
cask "openemu"
# Visual programming language for multimedia
cask "pd"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# Archive manager for data compression and backups
cask "rar"
# Server, language, and IDE for sound synthesis and algorithmic composition
cask "supercollider"
# Fluentd distribution package
cask "td-agent"
# Virtual machines UI using QEMU
cask "utm"
# Calling and messaging application focusing on security
cask "viber"
# GUI for the Neovim text editor
cask "vimr"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Wine wrapper built with SwiftUI
cask "whisky"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Lossless audio decoder
cask "xld"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Comic reader
cask "yacreader"
# Multiplayer code editor
cask "zed"
mas "Adblock Plus", id: 1432731683
mas "AdBlock Pro", id: 1018301773
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "CotEditor", id: 1024640650
mas "Couverture", id: 1552415914
mas "CrystalFetch", id: 6454431289
mas "Dipper", id: 6450242673
mas "Display Menu", id: 549083868
mas "EasyRes", id: 688211836
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Hex Fiend", id: 1342896380
mas "Hotspot Shield", id: 771076721
mas "iMazing Converter", id: 1292198261
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "LadioCast", id: 411213048
mas "LastPass", id: 926036361
mas "LINE", id: 539883307
mas "Memory Clean 2", id: 1114591412
mas "Microsoft Remote Desktop", id: 1295203466
mas "MIDI Loupe", id: 507075182
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Parallels Desktop", id: 1085114709
mas "QuickFTP", id: 1451646819
mas "Save to Pocket", id: 1477385213
mas "Save to Raindrop.io", id: 1549370672
mas "Session Pal", id: 1515213004
mas "Smart JSON Editor", id: 1268962404
mas "Tabstract", id: 6743376666
mas "The Unarchiver", id: 425424353
mas "Userscripts", id: 1463298887
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "bmewburn.vscode-intelephense-client"
vscode "mechatroner.rainbow-csv"
vscode "naco-siren.gradle-language"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "rianadon.vscode-java-checkstyle"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shengchen.vscode-checkstyle"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
go "github.com/prometheus/alertmanager/cmd/amtool"
go "github.com/takumakanari/cronv/cronv"
go "github.com/sonots/lltsv"
npm "@anthropic-ai/claude-code"
npm "@github/copilot"
npm "@google/gemini-cli"
npm "mcp-hub"
npm "percollate"
